# Регулярные выражение (поиск по паттерну)
# alice.yandex.ru
# Regular Expressions (re)
# r-строка - raw-string ("сырая" строка)
# Квантификаторы (quantity)
# {m} - ровно m раз
# {m,} - m раз и более
# {,n} - не более n раз
# {m,n} - от m до n (без пробелов)
# ? - от нуля до одного (аналог {0,1})
# * - от нуля до бесконечности(32767) {0,}
# + - от одного до бесконечности(32767) {1,}
import re

# pattern = r'\b\w{4}\b' # все слова из 4 символов
# pattern = r'\d' # все цифры от 0 до 9
# pattern = r'\d{3}' # три цифры подряд
# pattern = r'начало!\Z' # на что заканчивается
# pattern = '[0-5][0-9]' # две, идущие подряд
# pattern = '[а-яА-я]' # все буквы от "а" до "я" и от "А" до "Я"
# pattern = '[^ерм]' # исключить символы
# pattern = r'\((.+?)\)' # вытащить текст из скобок
# pattern = 'o{2,5}'
# pattern = 'Go{3,}gle'
# pattern = r'стеклянн?ый' # Вторая "н" может присутствовать, не обязательно

# "жадный" квантификатор (greedy quantifier)
# pattern = r'<img.*>' # самый "жадный" квантификатор
# pattern = r'<img.*?>' # ленивый (lazy, non-greedy) квантификатор
# pattern = r'<img[^>]+src="([^">]+)"' # только путь к картинке
# pattern = '<p>(.*?)</p>' # Cодержимое абзаца html
# test_string = '<b>Вот начало:</b><p>Содержимое</p><i>и т.д.</i>'
pattern = r'<p[^>]*>(.*?)</p>' # Cодержимое абзаца html (с атрибутами)
test_string = '<b>Центрируем содержимое абзаца</b><p align ="center">Содержимое</p>'

result1 = re.findall(pattern, test_string)

print(result1)

