# ООП(объектно ориентированное программирование) (encapsulation)
# Класс - прототип будущего объекта, который имеет свойства и миетоды по работе.
# Экземпляр - объект, пораждённый классом
# Атрибут - свойства и методы объекта
# Метод - действие объекта
#
# a = 3
# print(a.__class__.__name__)

# Методы классов
# self - контекстный объект, который ссылается на объект, который "вызывает" класс
class Greater:
    def hello(self, name='Noname') -> None:
        print('Привет,', name)

    def goodbye(self):
        print('Пока, мир!!!')


g = Greater()
g.hello('Оленёк')
g.goodbye()