# Файлы - набор данных в виде определенной структуры, сохраненный на носителе с присвоенным именем и, возможно, расширением
# name.txt
# t - текстовый файл (txt, html, xml)
# b - бинарные файлы (jpg, avi, mp3)
# w - write - файл открывается на запись(перезаписывается), если его нет, то создается
# a - append - запись в коннец файла
# r - read - чтение

fo = open('info.txt', 'wt', encoding='utf-8')

print(fo.mode)
print(fo.name)
print(fo.encoding)

count = fo.write('Этот текст будет в файле!')
print('В файл записано', count, 'байт!')

fo.close()