# ООП(объектно ориентированное программирование) (encapsulation)
# Класс - прототип будущего объекта, который имеет свойства и миетоды по работе.
# Экземпляр - объект, пораждённый классом
# Атрибут - свойства и методы объекта
# Метод - действие объекта
#
# a = 3
# print(a.__class__.__name__)

# Методы классов и анализ предыдущих вызовов
# self - контекстный объект, который ссылается на объект, который "вызывает" класс

from lib import Car

g = Car('Skoda', 'Octavia')
g.start_engine()
g.drive_to('город')