# Duck type - утиная типизация (прочитать)
# Шпоргалка по всем методам в пайтон
#
# Сеть интернет - сеть сетей
#
# Протокол - совокупность правил, регламентирующая ф-ции управления
#            передачи данных между компонентами компьютерной сети.
#
# TCP/IP
# TCP - Transmission Control Protocol - протокол управления передачей,
#       управляет потоком по маршрутам, обрабатывает маршруты, гарантирует
#       целостность доставки пакетов.
# IP - Internet Protocol - разбивает информацию на
#      пакеты (ip - дейтаграммы), определяет направления (маршруты),
#      обрабатывает поступления.
#
# HTTP(S) - Hyper Text Transfer Protokol (Secured) - протокол передачи
#           гипертекста (S - с механизмами шифрования).
# FTP - File Transfer Protokol
# SMTP - Simple Mail Transfer Protocol
#
# Хост - компьютер, являющийся частью сети, с которого другие компьютеры
#        запрашивают информацию
#
# Хост-система
# 1. Обязательная - IP-адрес: 195.34.32.11 - удобная для компа, не для человека
# 2. Необязательная - DNS (Domain Name System): https://www.yandex.spb.ru/ -
#    удобна для человека
#
# ASCII
# URL - Uniform Resource Locator
#
# Поиск/покупка/проверка доменных имен:
# nic.ru
# reg.ru
# whois.ru
#
# http(s)://доменное имя.зона/страница1/?параметр1=значение1&параметр2=значение2 - get метод
#
# Командная строка - простота удаленной работы, механизм автоматизации и т.д.
#
# # Команды Командной строки
# dir - просмотреть/пролистать каталоги (ls - в Linux)
# cd - change directory
# cp - копировать
# mkdir - создать директорию
# rm - удалить файл
# rm -r - удалить папку и все содержимое
# con - выводит консоль
# mv - переместить
#
#
#
#


