## Словари

res = {}

text = """Глава государства указал правительству интегрировать в мессенджер государственные 
и банковские услуги при участии Банка России. Необходимо обеспечить доступ граждан к наиболее 
востребованным услугам, следует из поручений по итогам совещания с членами правительства. 
Документ опубликован на сайте Кремля.
"""

commas = (',', '.', '?', '!')

for a in commas:
   text = text.replace(a, '')
lst_text = sorted(text.strip().lower().split())

for item in lst_text:
    if item in res.keys():
        res[item] += 1
    else:
        res[item] = 1

print('Частотный анализ слов текста')
for k, v in res.items():
    print(f'\t{k}: {v}')
