# Срез (у строки и других коллекций, кроме множеств(set))
# [начало:окончание(не включительно):шаг]

# s = 'добрый день'
#
# print(s[:6])  # от начала и до индекса(не включительно)
# print(s[0:6:1])  # полная запись с шагом
# print(s[7:11])   # от n до m без шага
# print(s[7:])  # от индекса и до конца
# print(s[:-6])  # с начала и до индекса(с отсчетом с конца)
# print(s[::-1])  # развернуть строку

s = 'Дорог Рим город или дорог Миргород'  # + и *
# Миргород дорог... дорог...
print(s[26:], (s[:6].lower() + '... ') * 2)

s = 'Дорог Рим'
# Город Миргород
temp = s.lower()
city = temp[:5][::-1]
res = city + ' ' + temp[6:][::-1] + city
print(res)






