# Файлы - набор данных в виде определенной структуры, сохраненный на носителе с присвоенным именем и, возможно, расширением
# name.txt
# t - текстовый файл (txt, html, xml)
# b - бинарные файлы (jpg, avi, mp3)
# w - write - файл открывается на запись(перезаписывается), если его нет, то создается
# a - append - запись в коннец файла
# r - read - чтение
# print(*args, sep=' ', end='\n', file=None, flush=False)

# Открытие с менеджером контеста
with open('info.txt', 'rt', encoding='utf-8') as fo:
    text = fo.read()
    lst = text.splitlines()
    print(lst)
   # Прроследит, чтобы файл закрылся

