# ООП(объектно ориентированное программирование) (encapsulation)
# Класс - прототип будущего объекта, который имеет свойства и миетоды по работе.
# Экземпляр - объект, пораждённый классом
# Атрибут - свойства и методы объекта
# Метод - действие объекта
#
# Методы классов и анализ предыдущих вызовов
# self - контекстный объект, который ссылается на объект, который "вызывает" класс


# Cтатичные члены класса
from lib import Separator


s = Separator()

for i in range(20):
    s.add_num(i)

print(s.get_odd())