# ООП(объектно ориентированное программирование) (encapsulation)
# Класс - прототип будущего объекта, который имеет свойства и миетоды по работе.
# Экземпляр - объект, пораждённый классом
# Атрибут - свойства и методы объекта
# Метод - действие объекта
#
# Методы классов и анализ предыдущих вызовов
# self - контекстный объект, который ссылается на объект, который "вызывает" класс


# Cтатичные члены класса
from lib import Sorter


s = Sorter()

s.add_word('Привет')
s.add_word('Прива')
s.add_word('Хай')
s.add_word('Здорова')

print(s.result())