# #  Кортеж (tuple, immutable) - тот же список, но не изменяемый; меньше жор памяти, быстрее обработка
# #  можно спросить длинну, перебрать содержимое в цикле
#                               Методы строки split() и join()
#  split() - возвращает список. Строку в список.
#  ''.join() - работает только со строками. Список в строку.

# text = '         один два      три    четыре'
# ip = '192.168.0.1'
#
# lst = ip.split('.')
#
# # ['192', '168', '0', '1']
#
# print(lst)
#
# text2 = '- или что угодно, но str '.join(lst)
#
# print(text2)

text = '  P y   t  h   o   n  '
res = ''.join(text.split())   #  убрать все пробелы
print(res)

## ДЗ
# stop_list = [] - Вводить слова, вывести сплитом пронумерованную коллонку слов в алфавит порядке, кроме стопслов из списка
# убрать слова в конце с помощью множеств(?)